{"title":"Commonly Misused Terms in Planning Poker - What They Really Mean","description":"Discover the most common misused and misspelled terms like 'PlanningPoker,' 'Scrum Poker,' and 'Backlog Refinement Poker' that all point to the popular agile estimation technique, Planning Poker. Learn the differences and boost your agile team’s efficiency with this lighthearted guide.","slug":"commonly-misused-terms-planning-poker","lastUpdated":"2024/10/09","author":"Gergely Bihary","coverImageId":"planning-poker-misused-terms","coverImageAlt":"Word cloud around Planning Poker","content":"\nIf you’ve ever stumbled across terms like “poker planning” or “backlog refinement poker” and wondered, “Are these just creative variations of Planning Poker, or am I missing out on a new agile technique?” — you’re not alone!\n\nPlanning Poker, also known as **Scrum Poker** or **Agile Poker**, is one of those techniques with many names (and misspellings!). Whether you're a seasoned Scrum Master or new to the world of agile, understanding these terms can be useful. In this post, we’ll break down these often misused and misspelled terms so you know exactly what they mean and why they all point back to the same technique.\n\n<div class=\"separator\"></div>\n\n## **1. PlanningPoker (aka Planning Poker)**\n\nLet’s start with the classic! **PlanningPoker** (sometimes spelled as a single word, “planningpoker”) is a consensus-based estimation technique used primarily in Scrum and Agile development. The team gathers to estimate the effort required to complete tasks using a deck of cards, with each card representing an estimate of the task’s size or complexity. It’s all about collaboration and reducing bias during sprint planning.\n\n*Need a refresher on how PlanningPoker works? Check out our [comprehensive guide to Planning Poker](https://planningpoker.live/knowledge-base/planning-poker-guide-agile-estimation-techniques).*\n\n<div class=\"separator\"></div>\n\n## **2. Poker Planning**\n\nAt first glance, **poker planning** sounds like it might be a new form of card game strategy, but don’t be fooled! It’s just a flip of words that refers to the exact same thing: Planning Poker. If you’re seeing “poker planning” in an agile context, rest assured — it’s still the same team-based estimation game.\n\nWe’ve got more on how to avoid common pitfalls when using the Planning Poker technique in our [blog post](https://planningpoker.live/knowledge-base/common-mistakes-planning-poker).\n\n<div class=\"separator\"></div>\n\n## **3. Scrum Poker**\n\n**Scrum Poker** is simply another name for Planning Poker, often used when teams want to emphasize the technique's connection to the **Scrum** framework. In Scrum, estimating the size of backlog items is a key part of the sprint planning process. And since Planning Poker is one of the most popular methods for doing that, the name **Scrum Poker** came into use.\n\nNeed help running a Scrum planning session? We’ve got you covered with our [guide of the top tools for SCRUM Masters](https://planningpoker.live/knowledge-base/essential-scrum-master-tools).\n\n<div class=\"separator\"></div>\n\n## **4. Agile Poker**\n\nMuch like Scrum Poker, **Agile Poker** is just a variation in name. Teams outside of Scrum, following broader agile methodologies, often use this term. Whether you’re following Kanban, Lean, or XP, **Agile Poker** fits right in. The process is still the same: gather the team, estimate tasks, and have a bit of fun while doing it.\n\n<div class=\"separator\"></div>\n\n## **5. Backlog Refinement Poker**\n\nNow, this term, **Backlog Refinement Poker**, gives a clue about when teams use Planning Poker. During backlog refinement sessions, teams go through the backlog of tasks and estimate their size. Playing Planning Poker at this stage helps ensure everyone is on the same page about the effort needed before tasks enter a sprint.\n\nNeed to know more about backlog refinement and how to make it more effective? Check out our post on [integrating JIRA with Planning Poker](https://planningpoker.live/knowledge-base/how-to-estimate-jira-issues-with-planning-poker).\n\n<div class=\"image-container\">\n    <video alt=\"PlanningPoker.live integrates with Jira and Linear\" src=\"https://res.cloudinary.com/dtvhnllmc/video/upload/v1682358351/Jira_Optimized_2_tugns9.mp4\" autoplay loop muted playsinline></video>\n    <p>Connect your Jira or Linear account in tools like PlanningPoker.live</p>\n</div>\n\n<div class=\"separator\"></div>\n\n## **6. Pocker Planning**\n\nAh yes, the classic typo: **Pocker Planning**! If you’ve ever typed \"pocker\" instead of \"poker,\" you’re not alone. But rest assured, **Pocker Planning** is still Planning Poker with an extra dash of creativity (or a finger slip). While the typo is common, it’s always fun to see how even small mistakes can give familiar terms a whole new vibe.\n\nFor a typo-free overview of how to make your next sprint planning session a success, head over to our [guide to all roles in a Planning Poker session](https://planningpoker.live/knowledge-base/planning-poker-and-the-scrum-roles).\n\n<div class=\"separator\"></div>\n\n## **7. Sprint Poker**\n\nMuch like \"Scrum Poker,\" **Sprint Poker** refers to using Planning Poker during a sprint planning meeting. This term emphasizes the technique’s use during the sprint phase of agile development, which is when tasks are estimated and prioritized. It's especially useful if you want to rank for sprint-related keywords.\n\n<div class=\"separator\"></div>\n\n## **8. Estimation Poker**\n\nSome teams refer to Planning Poker as **Estimation Poker** to focus on its core purpose: task estimation. This variation highlights the fact that the primary goal of the technique is to assign effort values to tasks, making it applicable to different stages of the agile workflow, not just sprint planning.\n\n<div class=\"separator\"></div>\n\n## **9. Fibonacci Poker**\n\nOccasionally, you might hear **Fibonacci Poker** mentioned. This term arises because Planning Poker often uses Fibonacci sequence numbers (1, 2, 3, 5, 8, 13, etc.) for estimates. The Fibonacci sequence helps teams keep estimates reasonable and avoids over-complicating task sizing.\n\n<div class=\"separator\"></div>\n\n## **10. Story Point Poker**\n\nSometimes referred to as **Story Point Poker**, this term zeroes in on the story point estimation system often used with Planning Poker. Story points are a popular unit for measuring the effort required for backlog items in agile teams.\n\n<div class=\"separator\"></div>\n\n### So, What's the Difference?\n\nIn the end, whether you call it **PlanningPoker**, **Poker Planning**, **Scrum Poker**, or even **Pocker Planning**, they all refer to the same technique: a fun, collaborative way to estimate effort and complexity in Agile teams. While the names may differ, the core process remains the same.\n\nSo, next time you see these terms thrown around, feel free to jump into the conversation knowing that you’re all talking about the same thing — even if the spelling is a little off.\n\n<div class=\"separator\"></div>\n\nIf you’re ready to use Planning Poker in your next sprint, why not try it out in [Microsoft Teams](https://planningpoker.live/integrations/teams), [Google Meet](https://planningpoker.live/integrations/meet) or explore the [PlanningPoker.live app](https://planningpoker.live/) to integrate it directly into your remote meetings?\n\nHappy estimating!\n"}