{"title":"How to estimate JIRA issues with Planning Poker","description":"In this short tutorial you can learn how to set up an integration with JIRA in PlanningPoker.live and estimate tickets with ease","slug":"how-to-estimate-jira-issues-with-planning-poker","lastUpdated":"2024/10/20","author":"Gergely Bihary","coverImageId":"topics","coverImageAlt":"A graphic showing issues stacked over each other","youtubeVideoId":"X5ox2EBk3Bs","content":"\n### Introduction\n\nPlanning Poker is a consensus-based technique for estimating effort or complexity. It is often used in agile software development to estimate user stories or product backlog items, making it an ideal fit for estimating JIRA issues.\n\n### Benefits of using Planning Poker to estimate JIRA issues\n\nThere are several benefits to using Planning Poker to estimate JIRA issues:\n\n- **Improved communication and collaboration:** Planning Poker encourages team members to discuss their estimates and come to a consensus. This can help to improve communication and collaboration within the team.\n- **More realistic estimates:** Planning Poker helps to reduce the impact of cognitive biases on estimates. This can lead to more realistic estimates of the effort or complexity involved in each issue.\n- **Increased team confidence:** Planning Poker can help to increase team confidence in their estimates. This is because estimates are made based on the collective knowledge and experience of the team.\n\n<div class=\"image-container\">\n    <img alt=\"Recent issues in the JIRA dropdown\" src=\"https://storage.googleapis.com/planning-poker-public-assets/assets/jira_history.png\">\n    <p>Recent issues in the JIRA dropdown</p>\n</div>\n\n### Steps to integrate JIRA with PlanningPoker.live\n\nTo estimate Jira issues with Planning Poker, follow these steps:\n\n1. **Create an estimation session.** You can do this on a website like [PlanningPoker.live](https://planningpoker.live/create). You will need to set your nickname and create a new room.\n\n2. **Connect your Jira account to your Planning Poker account.** This will allow you to select and view Jira issues directly from the planning poker session. To do this, just click on the **Connect to Jira** button in the topic editor. If you do not have a free PlanningPoker.live account, you'll be prompted to create one. You’ll then be redirected to Jira, where you can choose which project you want to link to PlanningPoker.live.\n\n3. **Select and estimate Jira issues.** Once your Jira account is connected, your most recent Jira issues will automatically appear in the dropdown menu of the topic editor. You can also search for specific issues by title or ID. When you select an issue, your team can start voting on it. After the estimates are revealed, simply click the **Upload** button to save the estimate back to Jira.\n\n4. **Batch import multiple Jira issues.** If you have several issues in your backlog that need to be estimated, PlanningPoker.live makes it easy with the **Batch Import** feature. To do this:\n   - Open the sidebar and click on **Import/Export**.\n   - Select **Batch Import Issues**.\n   - In the dialog, apply filters to find the relevant issues, such as filtering by project or sprint.\n   - Once you've selected multiple tickets, click **Import** to add them all to your current estimation session.\n\nThis feature helps you quickly gather all the necessary issues for estimation, making your planning sessions more efficient, especially when dealing with large backlogs.\n\n\n### Why Batch Import is a Game-Changer\n\nThe Batch Import feature significantly streamlines the estimation process for Agile teams working with large backlogs. Instead of manually importing each issue one by one, you can now pull in multiple tickets at once, saving time and ensuring that all necessary tasks are reviewed in a single session. This is especially useful for sprint planning meetings or backlog refinement sessions when you need to estimate several tasks quickly.\n\n\n<div class=\"image-container\">\n    <img alt=\"Click on the 'Connect to Jira' button to link your account\" src=\"https://storage.googleapis.com/planning-poker-public-assets/assets/jira_connect.png\">\n    <p>Click on the \"Connect to Jira\" button to link your account</p>\n</div>\n\n3. **Select the JIRA issues that you want to estimate.** Once connected, click on the \"Edit topic\" button and select a recent issue from the dropdown menu. You can also use the topic name field to search for Jira issues - they will appear in the dropdown as well.\n4. **Discuss the estimates and come to a consensus.** That's it! Select an issue and once everyone has cast their vote, the results will be displayed. Discuss the estimates and come to a consensus on the estimate for each issue.\n\n<div class=\"image-container\">\n    <img alt=\"Use the topic editor to search for issues\" src=\"https://storage.googleapis.com/planning-poker-public-assets/assets/jira_search.png\">\n    <p>Use the topic editor to search for issues</p>\n</div>\n\n### Some further tips\n\nHere are some tips for estimating JIRA issues with the Planning Poker technique:\n\n- **Use a clear and concise estimation scale.** A common estimation scale is the Fibonacci sequence (1, 2, 3, 5, 8, 13). This scale is effective because it allows for a wide range of estimates, but it is still relatively easy to understand and use.\n- **Don't be afraid to revise your estimates as you learn more about the work involved.** It is perfectly normal to revise your estimates as you learn more about the issue and the work involved.\n- **Hold regular Planning Poker sessions to estimate new JIRA issues and to revisit the estimates for existing issues.** This will help to ensure that your estimates are always up-to-date and that your team is on track to deliver projects on time and on budget.\n\nBy following these tips, you can use Planning Poker to effectively estimate JIRA issues and improve your team's communication, collaboration, and confidence.\n"}