{"title":"How to Use Planning Poker in Google Meet - A Step-by-Step Installation Guide for Scrum Teams","description":"Learn how to install and use PlanningPoker.live in Google Meet to run effective scrum poker sessions. This guide walks you through the process, from installation to leveraging key features like Jira integration, anonymous voting, and AI-powered summaries.","slug":"how-to-use-planning-poker-in-google-meet","lastUpdated":"2024/09/18","author":"Gergely Bihary","coverImageId":"Meet_1","coverImageAlt":"PlanningPoker.live in Google Meet","category":"guide","tags":["google meet","planning poker","agile","tutorial"],"content":"\nThis step-by-step tutorial will guide you through installing the [PlanningPoker.live app in Google Meet](https://planningpoker.live/integrations/meet), so you can streamline your planning sessions quickly and easily.\n\n## Why Use Planning Poker?\n\nPlanning Poker is an essential tool for teams practicing agile development, especially for estimating the effort required for tasks. It fosters collaboration, reduces biases, and ensures that all team members have a say in the estimation process. Using PlanningPoker.live within [Google Meet](https://meet.google.com) simplifies remote team planning by integrating seamlessly into your virtual meetings. Here’s why you should consider using it:\n\n- **Effortless Collaboration:** All participants can provide estimates in real-time during the meeting, ensuring consensus and preventing any one member from dominating the conversation.\n- **Bias-Free Voting:** Anonymous voting ensures fair estimates, avoiding influence from senior team members or dominant voices.\n- **Jira and Linear Integration:** Easily import tasks and export estimates directly into your project management tool, saving time on manual input.\n- **AI Summarization:** At the end of your meeting, receive a summary of key insights and action points, streamlining follow-up tasks.\n\nBy embedding PlanningPoker.live into your Google Meet workflow, your sprint planning sessions will become more efficient and accurate.\n\n## How to Install PlanningPoker.live in Google Meet\n\nFollow these simple steps to install the app:\n\n1. **Visit the Google Workspace Marketplace:** First, head over to the [Workspace Marketplace](https://workspace.google.com/marketplace/app/planningpokerlive/417578634660) and search for \"PlanningPoker.live.\" Once you’ve located the app, click on the blue “Install” button to add it to your Google account.\n\n<div class=\"image-container\">\n    <img alt=\"PlanningPoker.live in Marketplace\" src=\"https://res.cloudinary.com/dtvhnllmc/image/upload/c_scale,f_auto,w_1000,q_70/v1711188812/Meet_store.png\">\n    <p>PlanningPoker.live in the Workspace Marketplace</p>\n</div>\n\n2. **Grant Permissions:** A pop-up will appear, asking you to grant necessary permissions. This step is required for installing the add-on and does not give the app any access beyond what's necessary to function within your workspace.\n\n3. **Accessing PlanningPoker.live in Google Meet:** Once the installation is complete, head over to [Google Meet](https://meet.google.com). Start or join a meeting, and then click on the “Activities” icon located in the bottom-right corner to open the sidebar.\n\n<div class=\"image-container\">\n    <img alt=\"PlanningPoker.live in the Activities sidebar\" src=\"https://res.cloudinary.com/dtvhnllmc/image/upload/c_scale,f_auto,w_1000,q_70/v1711188812/Meet-apps-tray.png\">\n    <p>Google Meet Activities sidebar open</p>\n</div>\n\n4. **Launching the App:** Within the Activities sidebar, you’ll now see the PlanningPoker.live app. Click on its icon to launch it. After the initial load, you’ll land on the “Create/Join” page. Here, you can choose to either start a new planning poker session or join an existing one.\n\n   - If you're the meeting organizer, click \"Create Room\" to start a new session.\n   - If you’re joining, simply enter the room ID shared by your team.\n\n<div class=\"image-container\">\n    <img alt=\"PlanningPoker.live open in the Activities sidebar\" src=\"https://res.cloudinary.com/dtvhnllmc/image/upload/c_scale,f_auto,w_1000,q_70/v1711188812/Meet-landing.png\">\n    <p>PlanningPoker.live started in Google Meet</p>\n</div>\n\n## Inviting Participants\n\nOnce inside the session, the next step is to invite your teammates. To do this, click on the \"Invite\" button next to the room ID. This initiates a “Shared Activity” within Meet, automatically inviting other participants to install and open the PlanningPoker.live app.\n\nAlternatively, you can copy the room ID and share it manually with colleagues via chat or email. They can then join the room directly from their Meet interface or through the PlanningPoker.live web app.\n\n<div class=\"image-container\">\n    <img alt=\"PlanningPoker.live open in the Activities sidebar\" src=\"https://res.cloudinary.com/dtvhnllmc/image/upload/c_scale,f_auto,w_1000,q_70/v1711188812/Meet_3.png\">\n    <p>Click the \"Invite\" button to share the room</p>\n</div>\n\n## Exploring Key Features\n\nNow that you’ve installed PlanningPoker.live, here’s how to make the most of its features:\n\n- **Jira and Linear Integration:** Link PlanningPoker.live with your project management tools like [Jira](https://planningpoker.live/integrations/jira) or [Linear](https://planningpoker.live/integrations/linear) to import tasks directly. Once your planning session is complete, export the estimates back into your tool for easy tracking. Learn more about our [Jira integration](https://planningpoker.live/knowledge-base/how-to-estimate-jira-issues-with-planning-poker) and our [Linear integration](https://planningpoker.live/knowledge-base/estimate-linear-issues-planning-poker-live) in our knowledge base.\n  \n- **Anonymous Voting:** Keep the estimation process fair by enabling anonymous voting. This [feature](https://planningpoker.live/features) minimizes bias and encourages all team members to provide honest, independent estimates. Learn more about why this is beneficial in our [pitfalls](https://planningpoker.live/knowledge-base/common-mistakes-planning-poker) guide.\n\n- **Async Voting:** For teams spread across time zones or those who need flexibility, async voting allows participants to cast their votes on tasks at their convenience before the meeting.\n\n- **Meeting Timer:** Keep your planning sessions focused by using the built-in timer. It helps to ensure that each task is discussed within a reasonable timeframe, avoiding meeting fatigue.\n\n- **AI-Powered Summaries:** Once the session is over, use the AI to generate a summary of key points, decisions, and next steps. This is especially useful for distributing meeting notes or follow-up tasks to team members. Read about [all of our features](https://planningpoker.live/features) on our landing page.\n"}