{"title":"Step-by-step guide for using Planning Poker in Zoom","description":"Learn how to install the PlanningPoker.live app in Zoom. With the Zoom integration, teams can enhance their planning sessions without the need to switch between platforms.","slug":"how-to-use-planning-poker-in-zoom","lastUpdated":"2023/12/26","author":"Gergely Bihary","coverImageId":"zoom_app","coverImageAlt":"A screenshot showing the PlanningPoker.live app running in Zoom","category":"guide","tags":["Zoom Integration","Planning Poker","Agile Estimation","Remote Collaboration","Installation Guide"],"content":"\n\n### Introduction\nAs remote work continues to evolve, the need for effective collaboration tools becomes increasingly vital. This blog post explores the advantages of integrating PlanningPoker.live into Zoom meetings. With the [Zoom integration](https://planningpoker.live/integrations/zoom), teams can enhance their planning sessions without the need to switch between platforms.\n\n### Integrating PlanningPoker.live with Zoom\n\n**Step 1: Visit [planningpoker.live/integrations/zoom](https://planningpoker.live/integrations/zoom)**\n   - Start by navigating to planningpoker.live/integrations/zoom in your preferred web browser.\n\n**Step 2: Authorize the App and Install the Extension**\n   - Click the \"Install in Zoom\" link on the Planning Poker Zoom integration page.\n   - Follow the prompts to grant the necessary permissions. The app does not require any special permissions outside the core permissions needed to function.\n   - Once everything is granted, Zoom will automatically open with PlanningPoker.live installed.\n\n**Step 3: Open the Zoom App and Access PlanningPoker.live in meetings**\n   - Launch the Zoom application.\n   - Locate the \"Apps\" section within Zoom.\n   - Select \"Planning Poker\" from the available apps. If you are in a meeting, the app will open in sidebar mode. This enables you to see your colleagues while estimating.\n\n**Step 4: Share the app and invite everyone in the meeting**\n   - Set your name and create a new estimation room\n   - Click \"Invite\" to automatically share the app with everyone in the meeting. The invited members will automatically join the current estimation room once they install the app.\n\n\n### Benefits of the Integration:\n\n1. **Effortless Planning within Zoom:**\n   - Seamlessly transition from Zoom to PlanningPoker.live without leaving the meeting interface, ensuring a fluid planning experience.\n   - The same features you know from the web available inside Zoom. No restrictions.\n   - Easy room invitations: Just click on \"Invite\" and everyone in the meeting will join.\n   - Want to learn more? Check out our [comprehensive guide to Planning Poker](/knowledge-base/planning-poker-guide-agile-estimation-techniques).\n\n2. **Real-Time Collaboration easier than ever:**\n   - Engage in live discussions, task estimations, and decision-making directly within Zoom. This real-time collaboration fosters agility and adaptability.\n\n3. **Enhanced Focus and Productivity:**\n   - Maintain concentration on the task at hand by eliminating the need to switch between platforms. The streamlined approach minimizes distractions, boosting overall productivity.\n\n4. **Efficient Planning Poker Sessions:**\n   - Optimize the estimation process with efficient Planning Poker sessions conducted seamlessly within Zoom. This is particularly valuable for time-sensitive planning sessions, enabling teams to make informed decisions swiftly.\n\n5. **Enhanced Visibility and Transparency:**\n   - Foster transparency by providing all team members with a clear view of the estimation process. The integration ensures that everyone can witness task estimations, contributing to a more inclusive and collaborative planning environment.\n   - Learn more about [how to improve your sprint planning with Planning Poker](/knowledge-base/how-to-use-planning-poker-to-improve-sprint-planning).\n\n### Conclusion:\nBy following the straightforward steps outlined above, teams can seamlessly integrate Planning Poker into Zoom meetings, transforming their approach to agile planning. Elevate your remote collaboration experience and drive projects towards success by embracing this intuitive, efficient, and feature-rich integration.\n"}