{"title":"Maximize Your Estimation Process with Different Card Sets in PlanningPoker.live","description":"Learn how to use different card sets in PlanningPoker.live to enhance your Agile estimation sessions. Discover built-in presets, custom decks, and helpful options like \"Pass\" to make your planning smoother and more effective. Watch the tutorial video to get started!","slug":"maximize-estimation-with-different-card-sets-in-planningpoker-live","lastUpdated":"2024/12/15","author":"Gergely Bihary","coverImageId":"Tutorial_2_thumbnail_2_pkrdvi","coverImageAlt":"Video thumbnail image showing different card sets in PlanningPoker.live","youtubeVideoId":"Yb5hrUG3h9E","category":"guide","tags":["planning poker","fibonacci","agile","estimate","cards"],"content":"\n## **Maximize Your Estimation Process with Different Card Sets in PlanningPoker.live**\n\nAccurate estimation is at the heart of every productive agile team. Inconsistent or unclear estimates can slow down sprint planning, disrupt workflows, and lead to frustration. That’s why **PlanningPoker.live** offers flexible card sets to ensure your estimation sessions are as effective as possible. Whether you prefer standard presets like the Fibonacci sequence or need a completely custom deck, PlanningPoker.live has you covered.\n\nIn this guide, we’ll walk you through how to manage your cards, switch between different sets, enable useful options like “Pass,” and create your own custom decks tailored to your team’s needs. Let’s get started!\n\n\n### **1. Managing Your Cards and Reaction Emojis**\n\nWhen you enter a PlanningPoker.live session, your estimation cards are displayed on a floating panel at the bottom of the screen. This layout is designed for maximum visibility while keeping the interface uncluttered. However, depending on the complexity of your sprint planning or the size of your team, you may want more flexibility.\n\nThe **Cards button** lets you hide or show your card deck with a single click. This is particularly useful if you’re sharing your screen or need to focus on the discussion without distractions. Similarly, your **reaction emojis** — small icons that let you provide quick feedback or express agreement — are displayed above the cards. You can hide or show these emojis on demand to keep the interface streamlined.\n\nBy customizing the visibility of your cards and emojis, you can create a cleaner, distraction-free environment for your team to focus on the conversation. This flexibility helps ensure that everyone stays engaged, especially during longer planning sessions.\n\n\n### **2. Switching Between Different Card Sets for Better Estimates**\n\nNot all estimation tasks are the same, and using the right card set can make a big difference. For example, estimating a straightforward task might be best with a simple numeric scale, while more complex tasks benefit from broader categories like T-shirt sizes. PlanningPoker.live makes switching between card sets seamless.\n\nTo change your card set:\n\n1. Click **Room Settings** and select **Set Cards**.  \n2. Choose from a range of built-in presets that cater to common estimation practices:  \n    - **Fibonacci Sequence** (1, 2, 3, 5, 8, 13, etc.) is popular for estimating tasks with varying levels of complexity.  \n    - **T-shirt Sizing** (XS, S, M, L, XL) works well for tasks that don’t require precise numerical estimates.  \n    - **Sequential Numbers** (1, 2, 3, 4, 5) are ideal for quick, linear estimations.  \n\nDifferent card sets help your team avoid overthinking and instead focus on relative estimation. For instance, Fibonacci cards encourage teams to think in terms of magnitude rather than exact figures, which can simplify discussions about effort and complexity.\n\nExperiment with different presets to find what resonates most with your team. Sometimes switching card sets between sprints or for different types of tasks can refresh your team’s perspective and improve overall estimation accuracy.\n\n\n### **3. The “Pass” Option: Supporting Better Collaboration**\n\nSometimes, during an estimation session, a team member might not have enough information to provide a reliable estimate. Instead of making a guess or holding up the team, it’s helpful to have a way to gracefully opt out. That’s where the **Pass** option comes in.\n\nIn the **Set Cards** menu, you can toggle the **Pass option** to add a “Pass” card to your deck. This gives participants the ability to skip estimating a specific task without feeling pressured to provide a number or category. The “Pass” option promotes transparency and trust by encouraging team members to admit when they need more clarity.\n\nBy allowing for uncertainty, you can avoid misleading estimates and ensure that discussions remain honest and productive. After someone passes, you can revisit the task later with additional context or break it down into smaller, more manageable pieces. This approach leads to more accurate planning and a healthier team dynamic.\n\n\n### **4. Creating Custom Card Decks for Unique Workflows**\n\nWhile the default presets cover many estimation needs, some teams have unique workflows or estimation practices that require something more specific. **PlanningPoker.live** allows you to create fully customizable card decks that align perfectly with your team’s needs.\n\nHere’s how to create a custom deck:\n\n1. Navigate to **Room Settings** > **Set Cards**.  \n2. Select the **Custom Deck** option.  \n3. Enter your own values, which can be numeric (e.g., 10, 20, 50, 100) or non-numeric (e.g., “Quick Fix,” “Needs Research,” “Too Big”).  \n\nCustom decks are especially useful for specialized teams or projects that don’t fit neatly into traditional estimation models. For example:\n\n- **Design teams** might use cards like “Sketch,” “Prototype,” and “Final Design.”  \n- **DevOps teams** might prefer terms like “Minor,” “Major,” and “Critical.”  \n\nThe best part? Your custom decks are automatically saved to the **Cloud**, so you can easily access and reuse them in future sessions. This means you don’t have to rebuild your decks each time, saving your team valuable time and effort.\n\n\n### **Why Flexible Card Sets Matter**\n\nFlexible card sets give your team the freedom to estimate in a way that makes sense for the task at hand. By switching between presets, enabling the “Pass” option, and creating custom decks, you can ensure that your estimation process is both efficient and accurate.\n\n**PlanningPoker.live** empowers teams to adapt their estimation approach, avoid estimation fatigue, and maintain a healthy, collaborative workflow. No matter what challenges your sprint planning sessions bring, you’ll have the tools to handle them effectively.\n\n\n**Ready to take your estimations to the next level?**  \nTry out these features today at [**PlanningPoker.live**](#) and see how they can transform your team’s sprint planning sessions!"}